[{"text": "Zizi Afrique\nFoundation\nPOLICY BRIEF\nENHANCING KENYA’S YOUTH \nPREPAREDNESS FOR THE FOURTH \nINDUSTRIAL REVOLUTION (4IR)\nValues and Life Skills (VaLi) Working Group", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 0, "page_label": "1", "id": "data\\A5-policy-on-4IR.pdf:0:0"}}, {"text": "3\nPolicy Brief\nEnhancing Kenya’s Youth Preparedness for the Fourth Industrial \nRevolution (4IR) \nDespite improvement in education attainment levels and enrollment in \nTVET institutions, skills mismatch is still evident in the labour market. \nEmployers are interested in employing graduates with not only technical \nskills, but also other employable skills including life skills, entrepreneurship, \nfinancial planning, technology, and computing skills. While majority of job \nseekers are lacking common essential skills such as marketing and sales, \ncore values, numeracy, basic computer, and social-emotional skills were \nall deficient across all industries, according to studies. Nonetheless, more \nyouths are changing their minds about TVETs and are willing to enroll in \nTVET institutions to widen the scope of their skills. In addition, the Fourth \nIndustrial Revolution (4IR) comes at the right time to enhance human-\nmachine relationships, unlocking new market opportunities, and fueling \ngrowth across the global economy. This calls for adequate investment in \nrequisite 4IR skills especially through the TVET sector.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 2, "page_label": "3", "id": "data\\A5-policy-on-4IR.pdf:2:1"}}, {"text": "4\nWhy Fourth Industrial Revolution (4IR) Skills?\nThe 4IR represents a new era of innovation in technology: one that \nis enhancing human-machine relationships, unlocking new market \nopportunities, and fueling growth across the global economy. \nSpecifically, the 4IR centres on artificial intelligence (AI), robotics, 3-D \nprinting, cloud computing, and the Internet of Things (Io T).\nINDUSTRY 1.0\nThe use of water and \nsteam power to\nmechanize production.\nINDUSTRY 2.0\nThe introduction of\nelectricity, which enabled\nmass production.\nINDUSTRY 3.0\nThe use of IT and the\ninternet to digitize\nproduction, distribution,\nand services.\nINDUSTRY 4.0\nThe application of \nAI, ubiquitous digital\nnetworks and\ncyber-physical systems. \n1784 1870 1969 TODAY", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 3, "page_label": "4", "id": "data\\A5-policy-on-4IR.pdf:3:2"}}, {"text": "Figure 1: The 4IR in the Context of the Four Industrial Revolutions\nWhile the TVET curriculum includes technical courses, the technical and \nprofessional skills that are specifically unique to the 4IR have not been \nfully articulated and neither has there been significant investment in \nthe related resources, equipment, and workforce. \nBased on studies that were conducted in 2018, this policy brief explores \nthe preparedness of the youth for the 4IR by identifying the factors \nthat may be responsible for these gaps.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 3, "page_label": "4", "id": "data\\A5-policy-on-4IR.pdf:3:3"}}, {"text": "5\nDemand and Supply of Skills in the Labour Force Market\nAnalyses on the skills demanded and supplied in the market have \nestablished that marketing and sales, technical abilities, financial \nplanning and management, life skills, and entrepreneurship were \nlacking in both official and informal sectors (Awiti et al., 2019).  The \nanalysis of the gap between the skills sought by employers and the \nskills acquired by entry-level employees is shown in Figure 2.\nNumeracy Skills\nCore Values\nSocial-emotional skills\nLiteracy skills Info skills\nTechnical skills\nMarketing & Sales\nEntrepreneurship\nFinancial planning \nand management\nBasic computing skills\nCritical skills\ndemanded by\nemployers\nCritical skills\ndemanded by\nemployers\nCritical skills\ndemanded by\nemployers\nFigure 2: The Relationship Between Skills Demanded, Possessed, and Lacked by Entry-Level \nEmployees1\n1  Adapted from the Survey of employers and employees in the formal and informal \nsectors to determine entry-level skills among youth   (18–30 yrs.) in employ-\nment Kenya", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 4, "page_label": "5", "id": "data\\A5-policy-on-4IR.pdf:4:4"}}, {"text": "6\nResearch has it that employers are also affected by job market \nchallenges such as skill mismatch. Soft skills such as fundamental \ncommunication skills and presentation, integrity, and attitude towards \nthe work assigned are among the skills being sought after by employers \nwhen recruiting. \nMoreover, employees in both the formal and informal sectors \nrecommended the following skills to be taught by training institutions: \ntechnical skills, life skills, entrepreneurship, financial planning, \nmanagement and technology, as well as computing skills and core-\nvalues. \n62\n40\n35\n34\n32\n0\n64\n40\n35\n33\n0\n29\n0 50 100\nTechnical skills\nLife skills\nEntrepreneurship\nFinancial Planning and\nmanagement\nTechnology and computing\nskills\nCore-values\nInformal sector Formal sector\nFigure 3: Skill Sets Sought by Employers", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 5, "page_label": "6", "id": "data\\A5-policy-on-4IR.pdf:5:5"}}, {"text": "7\nAssociation Between 4IR Skills Awareness and Youth Characteristics.\nKenya has a total of 2,313 TVET institutions 3 spread across all the 47 \ncounties. Evidence shows that the top five courses offered in TVETs \nwere: tailoring, engineering, masonry, carpentry, hair dressing & \nbeauty (Figure 4). \nSource: Dalberg Data 2018\nMajority of youth depend on TVET training to get their post-basic \neducation training. This is because there are many factors that \ncontribute to the youth’s not continuing with education. These factors \ninclude, but are not limited to: dropping out of school at primary school, \nlack of school fees, teenage pregnancies, loss of interest in school and \nthe feeling that they had acquired all the education they needed. These, \nand other reasons are presented in Figure5.\n2 https:/ /www.tveta.go.ke/institutions/\n3  such as the accomplishment of 97.7% of primary schools having digital devices \ninstalled (as of September 19, 2019), the development of digital content on Kenya Education \nCloud, and the recent launch of Telkom and Google Loon Internet services", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 6, "page_label": "7", "id": "data\\A5-policy-on-4IR.pdf:6:6"}}, {"text": "8\nDigital Equipment, ICT Skills and 4IR Skills\nDesktop computers, laptop computers, tablets, and other mobile \ndevices are vital tools for continuing with education and training.  \nThe tools allow students to gain access to digital content, instructional \napps, social media, and educational programming. Online learning has \na lot of advantages, but it is also associated with more infrastructure, \ndesign, and instructional requirements. \nAdditionally, while there are various initiatives that support digital \nlearning3 , a large percentage of learners are unable to access or afford \ninternet services.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 7, "page_label": "8", "id": "data\\A5-policy-on-4IR.pdf:7:7"}}, {"text": "9\nRecommendations\nInterventions towards enhancing youth awareness and application \nof 4IR skills include those that can be instituted by Government, and \nmeasures to be put in place by TVET institutions.\n1. Proposed Interventions for National and County Governments\nb. Accessibility to reliable electricity:  The national government has \nenhanced access to electricity distribution. However, a large \nnumber of youths still do not have access to electricity across \nthe country, especially in rural and hard-to-reach areas. The \ngovernment, with support from other stakeholders such as the \nprivate sector, could further lower the costs of connection to the \ngrid and significantly reduce the cost of consumption to enable as \nmany homes as possible to have access to reliable electricity or \nsolar energy which is critical for internet connectivity.\nc. Accessibility to reliable and high-speed internet: The technological \nadvancement in Kenya is quite commendable, and this has been \nmade possible through the partnership of the government and \ntelecommunication companies. The launching of the 5G balloons \nin rural and hard-to-reach areas, the first on the continent, is the \nmost recent achievement. The government should continue to \nencourage, partner, and offer incentives to local and international \ntelecommunication companies to deepen internet connection or \nimprove signals especially in the rural and hard-to-reach areas. \nd. Equity: Gender equity has seen reduction in gender inequalities. \nHowever, the current policies on gender equality should be \nextended beyond admission and focus on courses and other", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 8, "page_label": "9", "id": "data\\A5-policy-on-4IR.pdf:8:8"}}, {"text": "10\nmarginalized groups. There needs to be an affirmative action to \nensure equity with respect to gender, vulnerable groups and \npersons with special needs for 4IR courses.\ne. TVET funding: Policy reforms on funding TVETs through the Higher \nEducation Loans Board (HELB) has seen increased enrollment of \nlearners in learning institutions.  However, focus on supporting \nonly the ones admitted through the Kenya Universities and \nColleges Central Placement Service (KUCCPS) has resulted in the \nexclusion of other learners. Therefore, the policies in TVET funding \nthrough HELB should be enhanced to include all learners in TVET \ninstitutions in Kenya, and not only the ones admitted through Kenya \nUniversities and Colleges Central Placement Service (KUCCPS). \nWhere possible, the funding should be differentiated to take into \naccount the nature of the courses. In addition, the costs of courses \ncould be further reduced to allow even the neediest to access \nrelevant education and programmes including the acquisition of \nthe 4IR skills.\nf. Design and deliver new curricula with a core 4IR technology: The \nreview of curricula has opened avenues to make sure that learners \ntrain on skills that are required by the market. The Directorate of \nTVET (DTVET) should continue to integrate key 4IR skills that will \nguarantee the realization of the Kenya Vision 2030. The country has \nan opportunity now, with the new Competency Based Education \nand Training (CBET), to introduce both 4IR skills as well as life skills \nand values which employers look out for in potential employees.\ng. Strategies to transfer skills:  As much as training is important, the \nskills need to be transferred to learners. The government will need", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 9, "page_label": "10", "id": "data\\A5-policy-on-4IR.pdf:9:9"}}, {"text": "11\nto come up with strategies to ensure the country has enough \nhuman resources to train the youth in 4IR.  This could be achieved \nthrough strategic collaborations with developed countries and \ninstitutions across the world.  Under such collaborations, trainers \nwill get the opportunity to acquire academic and industry skills \nunder the mentorship of experienced 4IR experts.\n2. Proposed Interventions for TVET Institutions\nc. Short courses: TVET institutions should organize short trainings to \neducate their learners on the current skills market trends.\nd. Mandatory internship: TVET institutions could link their students \nto industries relevant to the courses they are undertaking for \nmandatory internships that must be scored to form part of the \noverall grading. Currently, such internships exist but are optional, \nnot graded, and in some instances not relevant to the course the \nstudent is taking.\ne. Computer laboratories and virtual centres: All TVET institutions \nneed to have computer laboratories that are sufficiently equipped \nwith computers installed with the latest operating systems, and \nto have trainers adequately trained on general and 4IR-specific \ncomputer skills e.g., programming and data analytics, among \nothers. Graduands from TVET institutions could be supported with \nbasic tools of work such as a laptop and a smartphone.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 10, "page_label": "11", "id": "data\\A5-policy-on-4IR.pdf:10:10"}}, {"text": "12\nReferences\nAwiti, A., Orwa, C., Mbuvi, L., & Karumba, M. (2019). Whole Youth \nDevelopment in Kenya.\nDalenogare, L. S., Benitez, G. B., Ayala, N. F., & Frank, A. G. (2018). The \nexpected contribution of Industry 4.0 technologies for industrial \nperformance. International Journal of production economics, 204, \n383-394.\nLele, A. (2019). Industry 4.0. chapter 13. Disruptive Technologies for the \nMilitaries and Security. Smart Innovation, Systems and Technologies, \n132.\nMinistry of Education (MoE), 2014. Draft Technical and Vocational \nEducation and Training (TVET) Policy. Government Press. Nairobi\nMOEST. (2014). Draft Technical and Vocational Education and Training \n(TVET) Policy. Government Press. Nairobi, retrieved from https:/ /doi.\norg/www.education.go.ke/index.php/downloads/file/99-first-final-\ndraft-tvet-policy", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 11, "page_label": "12", "id": "data\\A5-policy-on-4IR.pdf:11:11"}}, {"text": "13", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 12, "page_label": "13", "id": "data\\A5-policy-on-4IR.pdf:12:12"}}, {"text": "Zizi Afrique\nFoundation\nFollow us:\nZizi Afrique Foundation\nwww.ziziafrique.org", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:49:13+03:00", "moddate": "2022-06-28T09:49:17+03:00", "trapped": "/False", "source": "data\\A5-policy-on-4IR.pdf", "total_pages": 14, "page": 13, "page_label": "14", "id": "data\\A5-policy-on-4IR.pdf:13:13"}}, {"text": "POLICY BRIEF\nZizi Afrique\nFoundation\nSUPPORTING YOUTH NOT IN \nEMPLOYMENT,  EDUCATION AND \nTRAINING  (NEET) TO ACCESS \nTECHNICAL  AND VOCATIONAL \nEDUCATION AND TRAINING \n(TVET) IN KENYA\nValues and Life Skills (VaLi) Working Group", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 0, "page_label": "1", "id": "data\\A5-Supporting-Youth-Policy.pdf:0:14"}}, {"text": "3\nPolicy Brief\nSupporting Youth not in Employment, Education and Training (NEET) \nto Access T echnical and Vocational Education and Training (TVET) in \nKenya.\nThe Government has instituted various reforms leading to the expansion \nof the TVET subsector. County governments have the autonomy to provide \nfinancial support to Vocational Technical Centres (VTCs) and to influence \nexpenditures in the VTCs (2010 Kenyan Constitution). In terms of financial \nresources, the support to TVET youth is commendable. However, not all \nTVET trainees receive government subsidies. Those who attend the lowest \nlevel of TVET, Vocational Training Centres (VTCs) do not receive any kind \nof support from government.  Despite the growth in the TVET budget as \na percentage of the total education budget over the last few years, the \ngrowing population in TVET institutions indicates a need for increased \nsupport from the national and county governments. In addition, the youth \nin VTCs do not have access to the   Higher Education Loans Board (HELB)— \nfacilities which ought to support all youth in TVET. Therefore, there is need \nto expand the scope of HELB coverage just as is the case with the private \nuniversities to ensure Youth NEET get access to TVET.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 2, "page_label": "3", "id": "data\\A5-Supporting-Youth-Policy.pdf:2:15"}}, {"text": "4\nIntroduction\nT echnical and Vocational Education and Training (TVET) has undergone \nvarious reforms in the recent years initiated by the Kenyan Government \nthrough the Ministry of Education. Some of the recent major reforms \ninclude the devolution of Vocational Technical Centres (VTCs) to the \ncounty levels, the introduction of the Competency Based Education and \nTraining (CBET) curriculum, and reforms through Sessional Paper No. 1 \nof 2019 on A Policy Framework for Reforming Education, Training and \nResearch for Sustainable Development. The CBET approach adopted \nin the TVET sector has introduced assessment based on competency. \nAs such, candidates are assessed against set occupational standards \nin which they are categorized as being successful if they exhibit \ncompetencies in certain predetermined fields. The TVET sector has \nbeen identified as a key sector in helping economies to solve the rising \nrates of unemployment, especially among the youth (UNESCO, 2016). \nEnrolment in TVET has been increasing over the years in Kenya. The \ntotal enrollment in TVET institutions grew from 142,418 in 2015 to \n476,202 in 2020 (Economic Survey, 2021).  However, TVET enrollment \nby gender indicates disparity between the numbers of male and female \ntrainees.  In 2015, the number of male students in TVET institutions \nwas 85,563 and grew to 258,084 by 2020. Female students’ enrollment \nwas still lagging behind with their numbers rising from 56,855 in 2015 \nto 193,121 in 2020 (Figure 1).", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 3, "page_label": "4", "id": "data\\A5-Supporting-Youth-Policy.pdf:3:16"}}, {"text": "5\nSource : Economic Survey 2021\n85,563\n56,855\n109,749\n86,117\n149,796\n117,869\n202,479\n157,459\n246,486\n184,112\n258,084\n193,121\n0\n50,000\n100,000\n150,000\n200,000\n250,000\n300,000\nM F M F M F M F M F M F\n2015 2016 2017 2018 2019 2020\nFigure 1: TVET Enrollment by Gender in Kenya\nIn the year 2020, majority (57%) of these students were in the \nVocational Training Centres (149,701) , followed by Public Technical \nand Vocational Colleges and National Polytechnics, with 130,064 and \n87,115 respectively. About 84,325 were in private institutions (Figure \n2). The upward enrollment in VTCs’ enrollment can be attributed to the \nefforts of county governments in developing and improving existing \nVTCs infrastructure, introduction of curricula, in-service instructors, \nand in some counties, subsidization of fees. However, it is important to \nnote that trainees who access VTCs and private institutions do not get \nany national government subsidy or HELB loans.\nSource:  Quarterly Labour Force Report 1st  Quarter 2021, Kenya National Bureau of Statistics \n7.4\n19.6\n14.5 13.1 13.3\n8.4\n24\n19.8\n11.4\n15.6\n7.5\n27.6\n20.1\n14.4 16.9\n0\n10\n20\n30\n15-19 20-24 25-29 30-34 Total\n2019 2020 2021 (Q1)", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 4, "page_label": "5", "id": "data\\A5-Supporting-Youth-Policy.pdf:4:17"}}, {"text": "Figure 3: Percentage of Youth Not in Education, Employment or Training (NEET) by Age\nThe TVET budget, as a percentage of the total education budget,", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 4, "page_label": "5", "id": "data\\A5-Supporting-Youth-Policy.pdf:4:18"}}, {"text": "6\nincreased between 2015/16 and 2019/20 but the sector spending as \nshare of GDP was only 0.3%. The TVET budget, as a percentage of the \ntotal education budget, increased marginally in 2017/18 to 2.7% of the \neducation budget from 2.5% the previous year. Further increases were \nin 2018/19 (to 3.7% of the education budget) and 2019/20 (to 5.4% \nof the education budget) (Table 1). The resources were utilized in the \nrecruitment of training instructors, and in the construction, equipping \nand operationalization of new TVCs.\nTVET Budget \n(Million) % of Education % of GDP\n2015/16 6,556.0 2.1 0.1\n2016/17 8,226.0 2.5 0.1\n2017/18 10,966.0 2.7 0.1\n2018/19 17,023.0 3.7 0.2\n2019/20 26,888.0 5.4 0.3\nSource: Economic Survey, 2020/21", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 5, "page_label": "6", "id": "data\\A5-Supporting-Youth-Policy.pdf:5:19"}}, {"text": "Table 1: TVET Budget and Share in Education in the Last Five Financial Years\nIt is important that the government placement program is well \npopularized especially among the Youth NEET. These youths who are \nwilling to enroll to TVETs, especially in rural and marginalized areas, \nmay not have this information about government-sponsored programs.\nDespite the government’s interventions and mobilization, including \nreforms in TVET institutions, the country is still recording high number \nof NEET youths who are not enrolled.  In the first quarter of 2021, \n16.9 percent of youths (aged 15 to 34 years old) in Kenya were not \nin education, employment, or training (KNBS, 2021). In the preceding", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 5, "page_label": "6", "id": "data\\A5-Supporting-Youth-Policy.pdf:5:20"}}, {"text": "7\nquarter, the rate had been 18.1 percent. However, the number of \nyoung people who were no longer in school, working, or receiving \nprofessional training increased significantly from 16 percent in the first \nquarter of 2020 (KNBS, 2021). (Figure 3).\nAlthough there are ongoing interventions to enhance access to TVET, \nincluding TVET capitation and HELB loan for the higher levels of TVET, \ntraining-related costs were cited as a major reason for stopping or not \nattending education and training in Kenya. Learning costs was cited by \n39 percent of the respondents as the first major reason for being out of \neducation and training. Across all the income groups (low, middle and \nhigh), education costs and parental discretion were the most important \nreasons for not attending school. Ancillary costs of education such as \nuniforms, provisions for boarders, and other school inputs are known \nto reduce student absence and dropout rates.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 6, "page_label": "7", "id": "data\\A5-Supporting-Youth-Policy.pdf:6:21"}}, {"text": "8\nPolicy Recommendations\nDesign  programs and courses targeting Youth NEET. The Kenya \nYouth Development Policy (2019)1 , categorizes this group as a group \nof interest and states that there is need to invest in continuous \nskills development targeting this category. Therefore, revitalizing, \nstreamlining and increasing resource allocation to vocational centres \ncan be crucial in attracting this group of youth to acquire the skills \nnecessary to create, through entrepreneurship or salaried employment. \nThis could reduce the percentage of Youth NEET in the country. TVET \nstakeholders, especially the MoE, the State Department of Vocational \nand Technical Training (VTT), the County Governments and TVETA will \nneed to come up with support channels and a framework that is inclusive \nof Youth NEET. This is possible since their key characteristics are now \nknown: majority  have secondary level of education, some have only \nprimary level while a few have university education. They live mainly \nin the rural areas where majority of the VTCs are located. It will be \nimportant to expand the scope of skill training to include life skills and \nvalues in addition to vocational training and apprenticeship systems, \nliteracy, numeracy, financial and information, and communication \nand technology literacy programmes in second-chance programmes \ntargeting youth. This can be complemented by other second-chance \nprogrammes such as in informal education targeting out-of-school \nyouth.\nEnhance use of well targeted financial support mechanisms including \nbursaries. The importance of education cost in limiting education and \ntraining attendance suggests there is need to enhance the use of well \n1 Kenya Youth Development Policy(2019)", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 7, "page_label": "8", "id": "data\\A5-Supporting-Youth-Policy.pdf:7:22"}}, {"text": "9\ntargeted support mechanisms and/or reduce the costs associated \nwith schooling to reduce incidences of non-attendance of TVET and \ntertiary education. Currently, 57% of TVET trainees do not get any \nnational government subsidy or HELB since they go to VTCs or private \ninstitutions. This needs to change.\nInitiate targeted communication strategies to curtail negative \nperceptions around TVET. For most students graduating from secondary \nschools, TVET institutions are not a first priority for them given the low \nrates of enrollments to TVETs compared to enrollments in universities. \nTherefore, there is need for government and other stakeholders to \ncome up with communication strategies that make TVET exciting and \nattractive to encourage many youths to choose it as one of their career \noptions right from basic education level. Research has it that the youth \nbenefit more from word-of-mouth communication as compared to \nother forms of communication. This should especially be explored when \nsharing information about TVET opportunities as well as in trying to \nchange youth perspectives on TVET as a career path. This would mean \nmaking use of, but not limited to, announcements in places of worship, \nsports gatherings, village barazas, and youth meetings and forums in \naddition to online, use of radio, TV, social media and newspapers. \nGovernment placement jobs targeting TVET graduates.  While most \nyouths are motivated by the goal of being financially stable, efforts \nby the government to ensure TVET graduates are absorbed in the \nlabor market should be intensified. Research has it that employers \nprefer working with youth who have some level of experience. The \ngovernment would expand the internship program which supports \nyoung graduates to access paid internships to youth in all levels of \nTVET. This should be possible if the responsible government ministries", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 8, "page_label": "9", "id": "data\\A5-Supporting-Youth-Policy.pdf:8:23"}}, {"text": "10\nand directorates as well as county governments directly engage the \nprivate sector including the Kenya Association of Manufacturers, the \nKenya Private Sector Alliance, among other key players to come up \nwith ways of encouraging them to provide internship opportunities to \nyouth from all levels of TVET.  \nAccessible and stable internet services and coverage. Youths who have \ngreat exposure to social media were predicted to be 1.71 times more \nwilling to enroll to TVET institutions compared to youths who did not \nhave any social media exposure. This can be attributed to employers, \ntrainers and training institutions resorting to the use of social media to \nadvertise job opportunities.  Most Youth NEET have no exposure to \nsocial media and this can be attributed to the high costs of internet and \nlack of access to strong internet especially in rural settings. Therefore, \npolicies that ensure access, and regulation of costs of internet in \nthe country need to be prioritized to help the youth gain access to \ninformation that they can leverage on and grow their skills. Provision \nof internet and digital services should be considered hand in hand with \nexisting government services such as the government digital resource \ncentres. As an example, the Kenya National Library Services (KNLS) \nare vital in the growth of the community. There is need to redesign \nthe already existing information resource centres to be the epicenters \nwhere the disadvantaged members of the community like Youth NEET \nwho have no access to internet and digital platforms can access internet \nas well as other government employment opportunities and related \ninformation and support. In rural areas where most NEET and TVET \ntrainees are located, it would be ideal to also have stable and accessible \ninternet and electricity to improve the utilization of such incentives \noffered by government. Through the “Last Mile” rural electrification \nprogramme, VTCs in rural areas are assured of connecting to electricity", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 9, "page_label": "10", "id": "data\\A5-Supporting-Youth-Policy.pdf:9:24"}}, {"text": "11\nthus increasing the likelihood of accessing internet connectivity.\nMaking Access to TVET more accessible to Girls, Women and Youth With \nDisabilities. Despite concerted efforts for gender equity, enrollment \nrates show that women and youth with disabilities are lagging behind \nin enrollment in TVETs. Therefore, government and all stakeholders \nshould put emphasis on the importance of enrolling girls and women \nin TVETs.  One of the key obstacles to girls and women enrollment \nin TVETs is child care. Both the national and county governments \nshould come up with a strategy of ensuring TVET institutions are child-\nfriendly. Having short courses and flexibility in the training schedule as \nwell as providing child-care services in the institutions are some of the \nstrategies the government and other stakeholders could consider so as \nto increase women’s enrollment in TVETs. If both men and women have \nskills, then they will both participate in supporting their families and \nin the long-run, contribute to national development. Assistive devices \ncould also be provided to youth with disabilities to enable them access \nTVET programmes.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 10, "page_label": "11", "id": "data\\A5-Supporting-Youth-Policy.pdf:10:25"}}, {"text": "12\nReferences\nBall, S. J. (2017). The education debate. Policy Press.\nDalberg, (2019). Youth not in education, employment and training \nin Kenya. Accessed through https:/ /dalberg.com/wp-content/\nuploads/2019/10/191011_Porticus-Youth-NEET-Kenya_Report_\nvF_0.pdf\nKamau, S. M. (2013). Challenges affecting the technical and vocational \neducation training youth polytechnics in Kiambu County. International \nJournal of Social Sciences and Entrepreneurship, 1(5), 679-687.\nKenya National Bureau of Statistics (KNBS), (2021). Quarterly Labour \nForce Reports. Government Printer. Nairobi. Accessed through https:/ /\nafricacheck.org/sites/default/files/media/documents/2021-11/\nKCSHP%20QLFS%202021_Quarter_1.pdf.", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 11, "page_label": "12", "id": "data\\A5-Supporting-Youth-Policy.pdf:11:26"}}, {"text": "Follow us:\nZizi Afrique Foundation\nwww.ziiafrique.org\nZizi Afrique\nFoundation", "metadata": {"producer": "Adobe PDF Library 16.0.7", "creator": "Adobe InDesign 17.3 (Windows)", "creationdate": "2022-06-28T09:53:05+03:00", "moddate": "2022-06-28T09:53:09+03:00", "trapped": "/False", "source": "data\\A5-Supporting-Youth-Policy.pdf", "total_pages": 14, "page": 13, "page_label": "14", "id": "data\\A5-Supporting-Youth-Policy.pdf:13:27"}}]